# CutsWall Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WallSweepInfo..::..CutsWall Property
WallSweepInfo Class See Also
---
Indicates if you want the sweep to cut geometry out of the host wall.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool CutsWall { get; set; }
```

Visual Basic
---
```text
Public Property CutsWall As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool CutsWall {
	bool get ();
	void set (bool value);
}
```

# Remarks
When a sweep is offset and embedded in the wall, it cuts the geometry from the wall.
# See Also
WallSweepInfo Class
Autodesk.Revit.DB Namespace